{"class_name": "Model", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv", "activity_regularizer": null, "kernel_size": [3, 3], "strides": [2, 2], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 64}}, {"class_name": "Activation", "inbound_nodes": [[["conv", 0, 0, {}]]], "name": "relu_conv1", "config": {"dtype": "float32", "trainable": true, "name": "relu_conv1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"data_format": "channels_last", "strides": [2, 2], "trainable": true, "name": "pool1", "padding": "valid", "pool_size": [3, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire2/squeeze1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 16}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu.squeeze1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire2/relu.squeeze1x1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu.squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire2/expand1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 64}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu.squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire2/expand3x3", "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 64}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu.expand1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire2/relu.expand1x1", "activation": "relu"}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu.expand3x3", "config": {"dtype": "float32", "trainable": true, "name": "fire2/relu.expand3x3", "activation": "relu"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2/relu.expand1x1", 0, 0, {}], ["fire2/relu.expand3x3", 0, 0, {}]]], "name": "fire2/concat", "config": {"axis": 3, "dtype": "float32", "trainable": true, "name": "fire2/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire3/squeeze1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 16}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu.squeeze1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire3/relu.squeeze1x1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu.squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire3/expand1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 64}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/relu.squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire3/expand3x3", "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 64}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu.expand1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire3/relu.expand1x1", "activation": "relu"}}, {"class_name": "Activation", "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu.expand3x3", "config": {"dtype": "float32", "trainable": true, "name": "fire3/relu.expand3x3", "activation": "relu"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire3/relu.expand1x1", 0, 0, {}], ["fire3/relu.expand3x3", 0, 0, {}]]], "name": "fire3/concat", "config": {"axis": 3, "dtype": "float32", "trainable": true, "name": "fire3/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "fire4/squeeze1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire4/squeeze1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 32}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu.squeeze1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire4/relu.squeeze1x1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu.squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire4/expand1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 128}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu.squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire4/expand3x3", "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 128}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu.expand1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire4/relu.expand1x1", "activation": "relu"}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu.expand3x3", "config": {"dtype": "float32", "trainable": true, "name": "fire4/relu.expand3x3", "activation": "relu"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4/relu.expand1x1", 0, 0, {}], ["fire4/relu.expand3x3", 0, 0, {}]]], "name": "fire4/concat", "config": {"axis": 3, "dtype": "float32", "trainable": true, "name": "fire4/concat"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "fire5/squeeze1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire5/squeeze1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 32}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu.squeeze1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire5/relu.squeeze1x1", "activation": "relu"}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu.squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire5/expand1x1", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 128}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire5/relu.squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "fire5/expand3x3", "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 128}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu.expand1x1", "config": {"dtype": "float32", "trainable": true, "name": "fire5/relu.expand1x1", "activation": "relu"}}, {"class_name": "Activation", "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu.expand3x3", "config": {"dtype": "float32", "trainable": true, "name": "fire5/relu.expand3x3", "activation": "relu"}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire5/relu.expand1x1", 0, 0, {}], ["fire5/relu.expand3x3", 0, 0, {}]]], "name": "fire5/concat", "config": {"axis": 3, "dtype": "float32", "trainable": true, "name": "fire5/concat"}}, {"class_name": "Dropout", "inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "drop9", "config": {"dtype": "float32", "trainable": true, "name": "drop9", "noise_shape": null, "seed": null, "rate": 0.5}}, {"class_name": "Conv2D", "inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10", "config": {"data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "conv10", "activity_regularizer": null, "kernel_size": [1, 1], "strides": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "scale": 1.0}}, "dilation_rate": [1, 1], "padding": "valid", "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "filters": 10}}, {"class_name": "Activation", "inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "relu_conv10", "config": {"dtype": "float32", "trainable": true, "name": "relu_conv10", "activation": "relu"}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d", "config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "name": "global_average_pooling2d"}}, {"class_name": "Activation", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "name": "loss", "config": {"dtype": "float32", "trainable": true, "name": "loss", "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]], "name": "squeezenet", "output_layers": [["loss", 0, 0]]}}